{
  "entries": [
    {
      "id": 2,
      "entry": "We used javascript to automate the creation of objects on the DOM. We built an array of objects and then defined a function to iterate over that object. we then created a function to insert those objects as HTML so they display on the webpage.",
      "mood": "Sad",
      "concept": "Modular Javascript",
      "date": ""
    },
    {
      "id": 3,
      "date": "11/25/2019",
      "concept": "Javascript",
      "entry": "Continuing with modular javascript, today we learned how to automate the creation of dialog boxes. We learned how to define a function that selects the first word of a class and the sibling item so that it then automates the creation of dialog boxes",
      "mood": "Neutral"
    },
    {
      "id": 4,
      "date": "11/26/2019",
      "concept": "Debugging",
      "entry": "We covered debugging the console using breakpoints in google chrome. We learned to set the breakpoint line and then use the debugger to slowdown the javascript and go line by line, function by function to solve the problem. I thought it was so helpfull that not only could you go line by line, but you could go into the functions and see what the function is actually changing, i.e. you can see that what the variables become after it iterates the array.",
      "mood": "Sad"
    },
    {
      "date": "2019-12-10",
      "concept": "api fetch calls",
      "entry": "today we covered api fetch calls. ",
      "mood": "Happy",
      "id": 5
    },
    {
      "date": "",
      "concept": "Modular Javascript",
      "entry": "We used javascript to automate the creation of objects on the DOM. We built an array of objects and then defined a function to interate over that object. we then created a function to insert those objects as HTML so they display on the webpage",
      "mood": "Sad",
      "id": 13
    },
    {
      "date": "",
      "concept": "Modular Javascript",
      "entry": "We used javascript to automate the creation of objects on the DOM. We built an array of objects and then defined a function to interate over that object. we then created a function to insert those objects as HTML so they display on the webpage",
      "mood": "Happy",
      "id": 15
    },
    {
      "date": "",
      "concept": "Modular Javascript",
      "entry": "We used javascript to automate the creation of objects on the DOM. We built an array of objects and then defined a function to interate over that object. we then created a function to insert those objects as HTML so they display on the webpage.",
      "mood": "Happy",
      "id": 16
    }
  ]
}